/*
 * Написать программу, в цикле for() выводящую в консоль строку "Hello world". 
 */
package Ex09_1;

public class Cycle {

	public static void main(String[] args) {
		for(int i=0; i<5; i++) {
			System.out.println("Hello world!");
		}
	}

}
