package Ex09_2;
/*Инициализировать одномерный массив из 5-ти элементов. 
 * Вывести его содержимое используя цикл for() 
 */
public class CycleMass {

	public static void main(String[] args) {
		int mass[] = {1,5,9,0,8};
				
		for(int i=0; i<5; i++) {
		
			System.out.println(mass[i]);
		}
	}
}
